---
kind: other
id: Properties.T:Autodesk.Revit.DB.InsertableObject
source: html/1046d35e-c33e-249d-bb94-3e05cb23fb90.htm
---
# InsertableObject Properties

The id of the assembly instance to which the element belongs.